zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_USBPHY.h
#define USBPHY_PFDA_PFD0_CLKGATE_MASK            (0x1U)
#define USBPHY_PFDA_PFD0_CLKGATE_SHIFT           (0U)
/*! PFD0_CLKGATE - PFD0 Clock Gate
 *  0b0..Enable
 *  0b1..Disable
 */
#define USBPHY_PFDA_PFD0_CLKGATE(x)              (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_PFD0_CLKGATE_SHIFT)) & USBPHY_PFDA_PFD0_CLKGATE_MASK)

#define USBPHY_PFDA_PFD0_FRAC_MASK               (0x7EU)
#define USBPHY_PFDA_PFD0_FRAC_SHIFT              (1U)
/*! PFD0_FRAC - PFD0 Fractional Divider */
#define USBPHY_PFDA_PFD0_FRAC(x)                 (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_PFD0_FRAC_SHIFT)) & USBPHY_PFDA_PFD0_FRAC_MASK)
/*! @} */

/*! @name PFDA_SET - PFD A */
/*! @{ */

#define USBPHY_PFDA_SET_PFD0_CLKGATE_MASK        (0x1U)
#define USBPHY_PFDA_SET_PFD0_CLKGATE_SHIFT       (0U)
/*! PFD0_CLKGATE - PFD0 Clock Gate */
#define USBPHY_PFDA_SET_PFD0_CLKGATE(x)          (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_SET_PFD0_CLKGATE_SHIFT)) & USBPHY_PFDA_SET_PFD0_CLKGATE_MASK)

#define USBPHY_PFDA_SET_PFD0_FRAC_MASK           (0x7EU)
#define USBPHY_PFDA_SET_PFD0_FRAC_SHIFT          (1U)
/*! PFD0_FRAC - PFD0 Fractional Divider */
#define USBPHY_PFDA_SET_PFD0_FRAC(x)             (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_SET_PFD0_FRAC_SHIFT)) & USBPHY_PFDA_SET_PFD0_FRAC_MASK)
/*! @} */

/*! @name PFDA_CLR - PFD A */
/*! @{ */

#define USBPHY_PFDA_CLR_PFD0_CLKGATE_MASK        (0x1U)
#define USBPHY_PFDA_CLR_PFD0_CLKGATE_SHIFT       (0U)
/*! PFD0_CLKGATE - PFD0 Clock Gate */
#define USBPHY_PFDA_CLR_PFD0_CLKGATE(x)          (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_CLR_PFD0_CLKGATE_SHIFT)) & USBPHY_PFDA_CLR_PFD0_CLKGATE_MASK)

#define USBPHY_PFDA_CLR_PFD0_FRAC_MASK           (0x7EU)
#define USBPHY_PFDA_CLR_PFD0_FRAC_SHIFT          (1U)
/*! PFD0_FRAC - PFD0 Fractional Divider */
#define USBPHY_PFDA_CLR_PFD0_FRAC(x)             (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_CLR_PFD0_FRAC_SHIFT)) & USBPHY_PFDA_CLR_PFD0_FRAC_MASK)
/*! @} */

/*! @name PFDA_TOG - PFD A */
/*! @{ */

#define USBPHY_PFDA_TOG_PFD0_CLKGATE_MASK        (0x1U)
#define USBPHY_PFDA_TOG_PFD0_CLKGATE_SHIFT       (0U)
/*! PFD0_CLKGATE - PFD0 Clock Gate */
#define USBPHY_PFDA_TOG_PFD0_CLKGATE(x)          (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_TOG_PFD0_CLKGATE_SHIFT)) & USBPHY_PFDA_TOG_PFD0_CLKGATE_MASK)

#define USBPHY_PFDA_TOG_PFD0_FRAC_MASK           (0x7EU)
#define USBPHY_PFDA_TOG_PFD0_FRAC_SHIFT          (1U)
/*! PFD0_FRAC - PFD0 Fractional Divider */
#define USBPHY_PFDA_TOG_PFD0_FRAC(x)             (((uint32_t)(((uint32_t)(x)) << USBPHY_PFDA_TOG_PFD0_FRAC_SHIFT)) & USBPHY_PFDA_TOG_PFD0_FRAC_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group USBPHY_Register_Masks */


/*!
 * @}
 */ /* end of group USBPHY_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_USBPHY_H_ */

